article/crontab-to-execute-jobs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-12 Thu 14:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用 crontab 来配置定时任务</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">使用 crontab 来配置定时任务</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org30c2d29">1. 简介</a></li>
<li><a href="#org0c3fcff">2. 使用方法</a>
<ul>
<li><a href="#org95b7576">2.1. 基础知识</a></li>
<li><a href="#org0e6a721">2.2. 操作示例</a></li>
<li><a href="#orgbd01bc8">2.3. 常见的定时任务</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org30c2d29" class="outline-2">
<h2 id="org30c2d29"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
在日常工作中往往需要开启定时任务，比如：定时备份文件夹，定时备份数据库等。那应
该以什么样的姿势完成这种事情呢。所谓 Linux 大法好，我们可以使用 crontab 来开启定
时任务
</p>
</div>
</div>

<div id="outline-container-org0c3fcff" class="outline-2">
<h2 id="org0c3fcff"><span class="section-number-2">2</span> 使用方法</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org95b7576" class="outline-3">
<h3 id="org95b7576"><span class="section-number-3">2.1</span> 基础知识</h3>
<div class="outline-text-3" id="text-2-1">
<p>
crontab 的命令格式是 <b>五个参数</b> 然后加 <b>命令</b> ，其中前五个参数分别表示如下含义：
</p>
<ul class="org-ul">
<li>m 任务执行的分钟</li>
<li>h 任务执行的小时</li>
<li>dom 任务执行的每月的时间</li>
<li>mon 任务执行的月份</li>
<li>dow 任务执行的每周的时间</li>
</ul>

<p>
在Ubuntu 操作系统中默认文件中写的就很清晰易懂
</p>
<div class="org-src-container">
<pre class="src src-text"># Edit this file to introduce tasks to be run by cron.
#
# Each task to run has to be defined through a single line
# indicating with different fields when the task will be run
# and what command to run for the task
#
# To define the time you can provide concrete values for
# minute (m), hour (h), day of month (dom), month (mon),
# and day of week (dow) or use '*' in these fields (for 'any').#
# Notice that tasks will be started based on the cron's system
# daemon's notion of time and timezones.
#
# Output of the crontab jobs (including errors) is sent through
# email to the user the crontab file belongs to (unless redirected).
#
# For example, you can run a backup of all your user accounts
# at 5 a.m every week with:
# 0 5 * * 1 tar -zcf /var/backups/home.tgz /home/
#
# For more information see the manual pages of crontab(5) and cron(8)
#
# m h  dom mon dow   command
</pre>
</div>
</div>
</div>

<div id="outline-container-org0e6a721" class="outline-3">
<h3 id="org0e6a721"><span class="section-number-3">2.2</span> 操作示例</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26597;&#30475;&#24403;&#21069;&#21551;&#29992;&#30340;&#23450;&#26102;&#20219;&#21153;</span>
crontab -l

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#22312;&#32534;&#36753;&#20219;&#21153;&#26159;&#26368;&#22909;&#23558;&#32534;&#36753;&#22120;&#35774;&#32622;&#25104; vim, &#21542;&#21017;&#31532;&#19968;&#27425;&#32534;&#36753;&#26102;&#20250;&#38382;&#20320;&#20351;&#29992;&#30340;&#32534;&#36753;&#22120;</span>
<span style="color: #6c71c4;">export</span> <span style="color: #6c71c4;">EDITOR</span>=vim

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#32534;&#36753;&#24403;&#21069;&#30340;&#23450;&#26102;&#20219;&#21153;</span>
crontab -e
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd01bc8" class="outline-3">
<h3 id="orgbd01bc8"><span class="section-number-3">2.3</span> 常见的定时任务</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>* 代表所有可能的值，如month字段为星号，则表示在满足其它字段的制约条件后每月
都执行该命令操作</li>
<li>, 可以用逗号隔开的值指定一个列表范围，例如 "1,2,5,7,8,9"</li>
<li>- 可以用整数之间的中杠表示一个整数范围，例如 "2-6" 表示 "2,3,4,5,6"</li>
<li>/ 可以用正斜线指定时间的间隔频率，例如 "0-23/2" 表示每两小时执行一次。</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#24403;&#22825;23&#28857;&#65292;&#31532;&#20108;&#22825;0&#28857;&#21040;&#20940;&#26216;7&#28857; &#27599;&#38548;1&#20998;&#38047;&#25191;&#34892;&#19968;&#27425;&#33050;&#26412;</span>
* 23,00-07/1 * * * /bin/sh /home/me/script.sh

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#27599;&#24180;&#30340;4&#26376;&#20221;&#27599;&#21608;&#30340;&#21608;&#19968;&#21040;&#21608;&#19977;&#30340;11&#28857;&#25191;&#34892;&#33050;&#26412;</span>
00 11 *  4 1-3 /bin/sh /home/me/update.sh
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2019-09-12 Thu 14:53. Created by Jinghui Hu at 2019-09-12 Thu 11:12.</p>
</div>
</body>
</html>
